InformationRegisters/упПравилаПрохожденияТочекВМобильномКлиенте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упПравилаПрохожденияТочекВМобильномКлиенте</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДопустимоеОтклонение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещеноОтчитыватьсяОРаботах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособПрисоединенияВнешнихФайлов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыПрисоединенияВнешнихФайлов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппироватьЗадачиПередачиЦенностей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещеноОтменятьТочкиМаршрута</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешеноГрупповоеВыполнениеРабот</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппироватьЗадачиСГрузомВТаре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособГруппировкиРабот</Name>
					<Comment>Способ группировки работ при осуществлении мультимодальных перевозок</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыГруппировкиРаботНаМобильномКлиенте</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗакрыватьКассовуюСменуПослеУбытияИзТочки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещеноОтменятьРаботыВТочкеВозвратаНаСклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешеноДосрочноеУбытиеИзТочкиМаршрута</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДоступаДействиеДосрочноеУбытиеИзТочкиМаршрута</Name>
					<Comment>Вид доступа для действия "Досрочное убытие из точки маршрута"</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыДоступаДействийМобильныйКлиент</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаОтветовДосрочноеУбытиеИзТочкиМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упНастройкиВопросаИОтветовПоСобытиямМониторинга</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрашиватьРазрешениеНаНазначениеТочкиМаршрутаСледующей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаОтветовНазначениеТочкиМаршрутаСледующей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упНастройкиВопросаИОтветовПоСобытиямМониторинга</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаТиповСобытийМониторинга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГруппыТиповСобытийМониторинга</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыводитьСтатусГотовностиТочки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантФормВыводитьСтатусГотовностиТочки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВариантыФормТочкиМобильныйКлиент</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыводитьИнформациюОСкладскихВоротах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантФормВыводитьИнформациюОСкладскихВоротах</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВариантыФормТочкиМобильныйКлиент</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАдреса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыАдресов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упПравилаПрохожденияТочекВМобильномКлиенте/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	КонтролироватьКоординатыВодителяПриПрохожденииТочки = ЗначениеЗаполнено(Запись.ДопустимоеОтклонение);
	
	УстановитьДоступность(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КонтролироватьКоординатыВодителяПриПрохожденииТочкиПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешеноГрупповоеВыполнениеРаботПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапрещеноОтчитыватьсяОРаботахПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппироватьЗадачиСГрузомВТареПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешеноДосрочноеУбытиеИзТочкиМаршрутаПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступность(Открытие = Ложь)

	Если КонтролироватьКоординатыВодителяПриПрохожденииТочки Тогда 
		Элементы.ДопустимоеОтклонение.Доступность = Истина;
		Если Не Открытие Тогда 
			Запись.ДопустимоеОтклонение = 0;
		КонецЕсли;
	Иначе	
		Элементы.ДопустимоеОтклонение.Доступность = Ложь;
	КонецЕсли;
	
	Если Запись.ЗапрещеноОтчитыватьсяОРаботах Тогда
		Элементы.РазрешеноГрупповоеВыполнениеРабот.Доступность = Ложь;
	ИначеЕсли Запись.РазрешеноГрупповоеВыполнениеРабот Тогда
		Элементы.ЗапрещеноОтчитыватьсяОРаботах.Доступность = Ложь;
	Иначе
		Элементы.РазрешеноГрупповоеВыполнениеРабот.Доступность = Истина;
		Элементы.ЗапрещеноОтчитыватьсяОРаботах.Доступность     = Истина;
	КонецЕсли; 
	
	Элементы.СпособГруппировкиРабот.Доступность = Запись.ГруппироватьЗадачиСГрузомВТаре;
	Элементы.ВидДоступаДействиеДосрочноеУбытиеИзТочкиМаршрута.Доступность = Запись.РазрешеноДосрочноеУбытиеИзТочкиМаршрута;
	
КонецПроцедуры

#КонецОбласти
